# Pandas DataFrame: Basics

In [1]:
import pandas as pd
import numpy as np

pd.__version__, np.__version__

(u'0.18.1', '1.11.1')

### Initializing a DataFrame from a Dictionary

In [2]:
data = {
    
     'vivek' : [35, 'M', 'Trainer'] ,
     'john'  : [22, 'M', 'Gardener'] ,
     'jill'  : [19, 'F', 'Accountant'] ,
     'ravi'  : [42, 'M', 'Sales'] 
}

df1 = pd.DataFrame(data)

df1

         jill      john   ravi    vivek
0          19        22     42       35
1           F         M      M        M
2  Accountant  Gardener  Sales  Trainer

In [3]:
df1.columns

Index([u'jill', u'john', u'ravi', u'vivek'], dtype='object')

In [4]:
df1.values

array([[19, 22, 42, 35],
       ['F', 'M', 'M', 'M'],
       ['Accountant', 'Gardener', 'Sales', 'Trainer']], dtype=object)

In [5]:
type(df1.values)

numpy.ndarray

#### Changing the Index

Many ways to do this, this is just one of them!

In [6]:
df1['characteristics'] = [ 'age', 'sex', 'profession']

df1

         jill      john   ravi    vivek characteristics
0          19        22     42       35             age
1           F         M      M        M             sex
2  Accountant  Gardener  Sales  Trainer      profession

In [7]:
df1.set_index('characteristics', inplace=True)

df1

                       jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

In [8]:
df1.columns.name = 'name'

df1

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

### From a Series

In [9]:
s1 = pd.Series(np.random.randint(0,100,7))

s2 = pd.Series(np.random.randint(0,100,8))

# side_by_side function from Wes McKinney, author of Pandas

def side_by_side(*objs, **kwds):
    from pandas.core.common import adjoin
    space = kwds.get('space', 4)
    reprs = [repr(obj).split('\n') for obj in objs]
    print adjoin(space, *reprs)
    
df2 = pd.DataFrame({ 's1' : s1, 's2' : s2 })

df2

     s1  s2
0   8.0   2
1  39.0  86
2  68.0  82
3  63.0  32
4  28.0  25
5  66.0  30
6  44.0  24
7   NaN   3

### Even a single Series can be used

In [10]:
pd.DataFrame(s1)

    0
0   8
1  39
2  68
3  63
4  28
5  66
6  44

### Head and Tail

In [11]:
df1.head(3)

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

In [12]:
df1.tail(3)

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

### Accessing Values in a DataFrame

In [13]:
df1

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

#### Fetch a Column

In [14]:
df1['john']

characteristics
age                 22
sex                  M
profession    Gardener
Name: john, dtype: object

In [15]:
type(df1['john'])

pandas.core.series.Series

#### Fetch Columns

In [16]:
df1

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

In [17]:
df1[[1,2]]

name                 john   ravi
characteristics
age                    22     42
sex                     M      M
profession       Gardener  Sales

### Fetch a Row or a Column by Label

#### Fetch Row by Label

.xs http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.xs.html

In [18]:
df1.xs('age')

name
jill     19
john     22
ravi     42
vivek    35
Name: age, dtype: object

In [19]:
type(df1.xs('age'))

pandas.core.series.Series

In [20]:
df1

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

#### Fetch Column by Label

In [21]:
df1.xs('vivek', axis=1)

characteristics
age                35
sex                 M
profession    Trainer
Name: vivek, dtype: object

### Fetch by Label but fall back on integer position based

http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.ix.html

In [22]:
df1.ix[2] # 3rd Row

name
jill     Accountant
john       Gardener
ravi          Sales
vivek       Trainer
Name: profession, dtype: object

#### Fetch Rows

In [23]:
df1[1:3] # Fetch rows 1 and 2 (0 indexed)

name                   jill      john   ravi    vivek
characteristics
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

#### .loc and .iloc

In [24]:
df1

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

In [25]:
df1.loc['age']

name
jill     19
john     22
ravi     42
vivek    35
Name: age, dtype: object

In [26]:
df1.loc[['age', 'profession']]

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
profession       Accountant  Gardener  Sales  Trainer

In [27]:
df2

     s1  s2
0   8.0   2
1  39.0  86
2  68.0  82
3  63.0  32
4  28.0  25
5  66.0  30
6  44.0  24
7   NaN   3

In [28]:
df2.iloc[[2,4,7]]

     s1  s2
2  68.0  82
4  28.0  25
7   NaN   3

Search by Index Label or Location with .ix

In [29]:
df2

     s1  s2
0   8.0   2
1  39.0  86
2  68.0  82
3  63.0  32
4  28.0  25
5  66.0  30
6  44.0  24
7   NaN   3

In [30]:
df2.ix[4]

s1    28.0
s2    25.0
Name: 4, dtype: float64

In [31]:
df1

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

In [32]:
df1.ix['sex']

name
jill     F
john     M
ravi     M
vivek    M
Name: sex, dtype: object

#### Fetching using Row,Column Combinations

In [33]:
df1

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

In [34]:
# Get the value in row 2 and column 3 i.e. 'M'

df1.ix[1,2], df1.ix[1,'ravi']

('M', 'M')

In [35]:
df1.iloc[1,2], df1.loc['sex','ravi']

('M', 'M')

In [36]:
# We want the region between index values 1-3 and columns 'john' and 'ravi'

df1.ix[1:3, ['john', 'ravi']]

name                 john   ravi
characteristics
sex                     M      M
profession       Gardener  Sales

In [37]:
df1.loc[['sex', 'profession'], ['john', 'ravi']]

name                 john   ravi
characteristics
sex                     M      M
profession       Gardener  Sales

In [38]:
df1.iloc[1:3, 1:3]

name                 john   ravi
characteristics
sex                     M      M
profession       Gardener  Sales

In [39]:
# Columns in above do not need to be adjacent 

df1.ix[1:2, ['john', 'vivek']]

name            john vivek
characteristics
sex                M     M

In [40]:
# column numbers can be used as well (axis=1)

df1.ix[0:2, 1:4]

name            john ravi vivek
characteristics
age               22   42    35
sex                M    M     M

In [41]:
# just like the above 

df1.ix[1:3, [0,3]]

name                   jill    vivek
characteristics
sex                       F        M
profession       Accountant  Trainer

In [42]:
# List of rows and columns can be provided as well

df1.ix[[1,2], [1,2]]

name                 john   ravi
characteristics
sex                     M      M
profession       Gardener  Sales

#### Fast label based lookup with .at 

http://pandas.pydata.org/pandas-docs/version/0.17.0/generated/pandas.DataFrame.at.html

In [43]:
df1.at['sex', 'john']

'M'

In [44]:
df1.at['profession', 'ravi']

'Sales'

#### .iat for using Location Based

In [45]:
df1

name                   jill      john   ravi    vivek
characteristics
age                      19        22     42       35
sex                       F         M      M        M
profession       Accountant  Gardener  Sales  Trainer

In [46]:
df1.iat[2, 3]

'Trainer'